# language: Chinese
功能: 测试查询list资源

场景: 先创建一系列的瓶子

  假定 新建资源:bottle 内容为[newItem]

  Examples:
  |-----------------|
  | newItem         |
  |-----------------|
  | id: "A1"        |
  | a: 'a1'         |
  | b: 'b1'         |
  |-----------------|
  | id: "A2"        |
  | a: 2            |
  | b: 'b2'         |
  |-----------------|
  | id: "id3"       |
  | a: 3            |
  | b: 'b3'         |
  |-----------------|

场景: 列出资源
  当   列出资源:bottle
  那么 期望上次的结果是：
    ----
    [
      id: 'A1'
      a: 'a1'
      b: 'b1'
    ,
      id: "A2"
      a: 2
      b: 'b2'
    ,
      id: "id3"
      a: 3
      b: 'b3'
    ]
    ----



